Tekla.Structures.TeklaStructuresVariables
The EnvironmentVariables class contains a sorted list specializing in getting active
environment variables and advanced option settings. It also checks options.ini files
in the active model folder as well as options_user.ini files.

Tekla.Structures.TeklaStructuresVariables.PourManagementOptionName
The advanced option name for pour management.

Tekla.Structures.TeklaStructuresVariables.Instance
The instance.

Tekla.Structures.TeklaStructuresVariables.#cctor
Initializes static members of the Tekla.Structures.TeklaStructuresVariables class.

Tekla.Structures.TeklaStructuresVariables.Add(System.String)
Adds a variable to the list.
key: The variable to be added.

Tekla.Structures.TeklaStructuresVariables.Get(System.String)
Gets a key.
key: The key to get.
Returns: The key.

Tekla.Structures.TeklaStructuresVariables.ContainsVariable(System.String)
Gets a key.
key: The key to get.
Returns: The key.